import * as Yup from 'yup';

export const loginSchema = Yup.object().shape({
  email: Yup.string()
    .email('Неправильна адреса електронної пошти')
    .max(64, 'Занадто довга адреса електронної пошти')
    .required("Обов'язкове до заповнення поле"),
  password: Yup.string()
    .min(8, 'Пароль занадто короткий (мінімум 8 символів)')
    .max(128, 'Пароль занадто довгий (максимум 128 символів)')
    .required("Обов'язкове до заповнення поле"),
});

export const registerSchema = Yup.object().shape({
  name: Yup.string()
    .min(2, "Ім'я занадто коротке.")
    .max(64, "Ім'я занадто довге.")
    .required('Будь ласка, введіть імʼя.'),
  email: Yup.string()
    .email('Невірно введена пошта.')
    .max(64, 'Занадто довга адреса електронної пошти')
    .required('Будь ласка, введіть пошту.'),
  password: Yup.string()
    .min(8, 'Пароль занадто короткий (мінімум 8 символів)')
    .max(128, 'Пароль занадто довгий (максимум 128 символів)')
    .required('Будь ласка, введіть пароль.'),
});
